[
   [
      "Guardians of the Galaxy Vol. 2",
      "2017",
      "PG-13",
      "05 May 2017",
      "136 min",
      "Action, Adventure, Sci-Fi",
      "James Gunn",
      "James Gunn, Dan Abnett (based on the Marvel comics by), Andy Lanning (based on the Marvel comics by), Steve Englehart (Star-lord created by), Steve Gan (Star-lord created by), Jim Starlin (Gamora and Drax created by), Stan Lee (Groot created by), Larry Lieber (Groot created by), Jack Kirby (Groot created by), Bill Mantlo (Rocket Raccoon created by), Keith Giffen (Rocket Raccoon created by), Steve Gerber (Howard the Duck created by), Val Mayerik (Howard the Duck created by)",
      "Chris Pratt, Zoe Saldana, Dave Bautista, Vin Diesel",
      "The Guardians must fight to keep their newfound family together as they unravel the mystery of Peter Quill's true parentage.",
      "English",
      "USA, New Zealand, Canada",
      "4 wins & 12 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMTg2MzI1MTg3OF5BMl5BanBnXkFtZTgwNTU3NDA2MTI@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "7.8/10"
         ],
         [
            "Rotten Tomatoes",
            "82%"
         ],
         [
            "Metacritic",
            "67/100"
         ]
      ],
      "67",
      "7.8",
      "287,912",
      "tt3896198",
      "movie",
      "22 Aug 2017",
      "$389,804,217",
      "Walt Disney Pictures",
      "https://marvel.com/guardians",
      "True"
   ],
   [
      "The Shawshank Redemption",
      "1994",
      "R",
      "14 Oct 1994",
      "142 min",
      "Crime, Drama",
      "Frank Darabont",
      "Stephen King (short story \"Rita Hayworth and Shawshank Redemption\"), Frank Darabont (screenplay)",
      "Tim Robbins, Morgan Freeman, Bob Gunton, William Sadler",
      "Chronicles the experiences of a formerly successful banker as a prisoner in the gloomy jailhouse of Shawshank after being found guilty of a crime he did not commit. The film portrays the man's unique way of dealing with his new, torturous life; along the way he befriends a number of fellow prisoners, most notably a wise long-term inmate named Red.",
      "English",
      "USA",
      "Nominated for 7 Oscars. Another 19 wins & 29 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BODU4MjU4NjIwNl5BMl5BanBnXkFtZTgwMDU2MjEyMDE@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "9.3/10"
         ],
         [
            "Rotten Tomatoes",
            "91%"
         ],
         [
            "Metacritic",
            "80/100"
         ]
      ],
      "80",
      "9.3",
      "1,864,012",
      "tt0111161",
      "movie",
      "27 Jan 1998",
      "N/A",
      "Columbia Pictures",
      "N/A",
      "True"
   ],
   [
      "The Godfather",
      "1972",
      "R",
      "24 Mar 1972",
      "175 min",
      "Crime, Drama",
      "Francis Ford Coppola",
      "Mario Puzo (screenplay), Francis Ford Coppola (screenplay), Mario Puzo (novel)",
      "Marlon Brando, Al Pacino, James Caan, Richard S. Castellano",
      "When the aging head of a famous crime family decides to transfer his position to one of his subalterns, a series of unfortunate events start happening to the family, and a war begins between all the well-known families leading to insolence, deportation, murder and revenge, and ends with the favorable successor being finally chosen.",
      "English, Italian, Latin",
      "USA",
      "Won 3 Oscars. Another 24 wins & 27 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BZTRmNjQ1ZDYtNDgzMy00OGE0LWE4N2YtNTkzNWQ5ZDhlNGJmL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "9.2/10"
         ],
         [
            "Rotten Tomatoes",
            "99%"
         ],
         [
            "Metacritic",
            "100/100"
         ]
      ],
      "100",
      "9.2",
      "1,276,666",
      "tt0068646",
      "movie",
      "09 Oct 2001",
      "N/A",
      "Paramount Pictures",
      "http://www.thegodfather.com",
      "True"
   ],
   [
      "The Godfather: Part II",
      "1974",
      "R",
      "20 Dec 1974",
      "202 min",
      "Crime, Drama",
      "Francis Ford Coppola",
      "Francis Ford Coppola (screenplay), Mario Puzo (screenplay), Mario Puzo (novel)",
      "Al Pacino, Robert Duvall, Diane Keaton, Robert De Niro",
      "The continuing saga of the Corleone crime family tells the story of a young Vito Corleone growing up in Sicily and in 1910s New York; and follows Michael Corleone in the 1950s as he attempts to expand the family business into Las Vegas, Hollywood and Cuba.",
      "English, Italian, Spanish, Latin, Sicilian",
      "USA",
      "Won 6 Oscars. Another 11 wins & 20 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMjZiNzIxNTQtNDc5Zi00YWY1LThkMTctMDgzYjY4YjI1YmQyL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "9.0/10"
         ],
         [
            "Rotten Tomatoes",
            "97%"
         ],
         [
            "Metacritic",
            "85/100"
         ]
      ],
      "85",
      "9.0",
      "879,723",
      "tt0071562",
      "movie",
      "24 May 2005",
      "N/A",
      "Paramount Pictures",
      "http://www.thegodfather.com/",
      "True"
   ],
   [
      "The Dark Knight",
      "2008",
      "PG-13",
      "18 Jul 2008",
      "152 min",
      "Action, Crime, Drama",
      "Christopher Nolan",
      "Jonathan Nolan (screenplay), Christopher Nolan (screenplay), Christopher Nolan (story), David S. Goyer (story), Bob Kane (characters)",
      "Christian Bale, Heath Ledger, Aaron Eckhart, Michael Caine",
      "Set within a year after the events of Batman Begins, Batman, Lieutenant James Gordon, and new district attorney Harvey Dent successfully begin to round up the criminals that plague Gotham City until a mysterious and sadistic criminal mastermind known only as the Joker appears in Gotham, creating a new wave of chaos. Batman's struggle against the Joker becomes deeply personal, forcing him to \"confront everything he believes\" and improve his technology to stop him. A love triangle develops between Bruce Wayne, Dent and Rachel Dawes.",
      "English, Mandarin",
      "USA, UK",
      "Won 2 Oscars. Another 151 wins & 154 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMTMxNTMwODM0NF5BMl5BanBnXkFtZTcwODAyMTk2Mw@@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "9.0/10"
         ],
         [
            "Rotten Tomatoes",
            "94%"
         ],
         [
            "Metacritic",
            "82/100"
         ]
      ],
      "82",
      "9.0",
      "1,848,050",
      "tt0468569",
      "movie",
      "09 Dec 2008",
      "$533,316,061",
      "Warner Bros. Pictures/Legendary",
      "http://thedarkknight.warnerbros.com/",
      "True"
   ],
   [
      "12 Angry Men",
      "1957",
      "NOT RATED",
      "01 Apr 1957",
      "96 min",
      "Crime, Drama",
      "Sidney Lumet",
      "Reginald Rose (story), Reginald Rose (screenplay)",
      "Martin Balsam, John Fiedler, Lee J. Cobb, E.G. Marshall",
      "The defense and the prosecution have rested and the jury is filing into the jury room to decide if a young man is guilty or innocent of murdering his father. What begins as an open-and-shut case of murder soon becomes a detective story that presents a succession of clues creating doubt, and a mini-drama of each of the jurors' prejudices and preconceptions about the trial, the accused, and each other. Based on the play, all of the action takes place on the stage of the jury room.",
      "English",
      "USA",
      "Nominated for 3 Oscars. Another 16 wins & 8 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMWU4N2FjNzYtNTVkNC00NzQ0LTg0MjAtYTJlMjFhNGUxZDFmXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.9/10"
         ],
         [
            "Rotten Tomatoes",
            "100%"
         ],
         [
            "Metacritic",
            "96/100"
         ]
      ],
      "96",
      "8.9",
      "512,340",
      "tt0050083",
      "movie",
      "06 Mar 2001",
      "N/A",
      "Criterion Collection",
      "http://www.criterion.com/films/27871-12-angry-men",
      "True"
   ],
   [
      "Schindler's List",
      "1993",
      "R",
      "04 Feb 1994",
      "195 min",
      "Biography, Drama, History",
      "Steven Spielberg",
      "Thomas Keneally (book), Steven Zaillian (screenplay)",
      "Liam Neeson, Ben Kingsley, Ralph Fiennes, Caroline Goodall",
      "Oskar Schindler is a vainglorious and greedy German businessman who becomes an unlikely humanitarian amid the barbaric German Nazi reign when he feels compelled to turn his factory into a refuge for Jews. Based on the true story of Oskar Schindler who managed to save about 1100 Jews from being gassed at the Auschwitz concentration camp, it is a testament to the good in all of us.",
      "English, Hebrew, German, Polish",
      "USA",
      "Won 7 Oscars. Another 78 wins & 44 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BNDE4OTMxMTctNmRhYy00NWE2LTg3YzItYTk3M2UwOTU5Njg4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.9/10"
         ],
         [
            "Rotten Tomatoes",
            "96%"
         ],
         [
            "Metacritic",
            "93/100"
         ]
      ],
      "93",
      "8.9",
      "958,690",
      "tt0108052",
      "movie",
      "09 Mar 2004",
      "N/A",
      "Universal Pictures",
      "http://www.schindlerslist.com",
      "True"
   ],
   [
      "Pulp Fiction",
      "1994",
      "R",
      "14 Oct 1994",
      "154 min",
      "Crime, Drama",
      "Quentin Tarantino",
      "Quentin Tarantino (stories), Roger Avary (stories), Quentin Tarantino",
      "Tim Roth, Amanda Plummer, Laura Lovelace, John Travolta",
      "Jules Winnfield (Samuel L. Jackson) and Vincent Vega (John Travolta) are two hit men who are out to retrieve a suitcase stolen from their employer, mob boss Marsellus Wallace (Ving Rhames). Wallace has also asked Vincent to take his wife Mia (Uma Thurman) out a few days later when Wallace himself will be out of town. Butch Coolidge (Bruce Willis) is an aging boxer who is paid by Wallace to lose his fight. The lives of these seemingly unrelated people are woven together comprising of a series of funny, bizarre and uncalled-for incidents.",
      "English, Spanish, French",
      "USA",
      "Won 1 Oscar. Another 60 wins & 68 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMTkxMTA5OTAzMl5BMl5BanBnXkFtZTgwNjA5MDc3NjE@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.9/10"
         ],
         [
            "Rotten Tomatoes",
            "94%"
         ],
         [
            "Metacritic",
            "94/100"
         ]
      ],
      "94",
      "8.9",
      "1,463,429",
      "tt0110912",
      "movie",
      "19 May 1998",
      "N/A",
      "Miramax Films",
      "N/A",
      "True"
   ],
   [
      "The Lord of the Rings: The Return of the King",
      "2003",
      "PG-13",
      "17 Dec 2003",
      "201 min",
      "Adventure, Drama, Fantasy",
      "Peter Jackson",
      "J.R.R. Tolkien (novel), Fran Walsh (screenplay), Philippa Boyens (screenplay), Peter Jackson (screenplay)",
      "Noel Appleby, Ali Astin, Sean Astin, David Aston",
      "The final confrontation between the forces of good and evil fighting for control of the future of Middle-earth. Hobbits: Frodo and Sam reach Mordor in their quest to destroy the \"one ring\", while Aragorn leads the forces of good against Sauron's evil army at the stone city of Minas Tirith.",
      "English, Quenya, Old English, Sindarin",
      "USA, New Zealand",
      "Won 11 Oscars. Another 196 wins & 122 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BYWY1ZWQ5YjMtMDE0MS00NWIzLWE1M2YtODYzYTk2OTNlYWZmXkEyXkFqcGdeQXVyNDUyOTg3Njg@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.9/10"
         ],
         [
            "Rotten Tomatoes",
            "95%"
         ],
         [
            "Metacritic",
            "94/100"
         ]
      ],
      "94",
      "8.9",
      "1,334,832",
      "tt0167260",
      "movie",
      "25 May 2004",
      "$364,000,000",
      "New Line Cinema",
      "http://www.lordoftherings.net/",
      "True"
   ],
   [
      "The Good, the Bad and the Ugly",
      "1966",
      "APPROVED",
      "29 Dec 1967",
      "178 min",
      "Western",
      "Sergio Leone",
      "Luciano Vincenzoni (story), Sergio Leone (story), Agenore Incrocci (screenplay), Furio Scarpelli (screenplay), Luciano Vincenzoni (screenplay), Sergio Leone (screenplay), Mickey Knox (English version by)",
      "Eli Wallach, Clint Eastwood, Lee Van Cleef, Aldo Giuffre",
      "Blondie (The Good) is a professional gunslinger who is out trying to earn a few dollars. Angel Eyes (The Bad) is a hit man who always commits to a task and sees it through, as long as he is paid to do so. And Tuco (The Ugly) is a wanted outlaw trying to take care of his own hide. Tuco and Blondie share a partnership together making money off Tuco's bounty, but when Blondie unties the partnership, Tuco tries to hunt down Blondie. When Blondie and Tuco come across a horse carriage loaded with dead bodies, they soon learn from the only survivor (Bill Carson) that he and a few other men have buried a stash of gold in a cemetery. Unfortunately Carson dies and Tuco only finds out the name of the cemetery, while Blondie finds out the name on the grave. Now the two must keep each other alive in order to find the gold. Angel Eyes (who had been looking for Bill Carson) discovers that Tuco and Blondie met with Carson and knows they know the location of the gold. All he needs is for the two to lead him to it. Now The Good, The Bad and The Ugly must all battle it out to get their hands on $200,000 worth of gold.",
      "Italian, English",
      "Italy, Spain, West Germany, USA",
      "1 win & 3 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BOTQ5NDI3MTI4MF5BMl5BanBnXkFtZTgwNDQ4ODE5MDE@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.9/10"
         ],
         [
            "Rotten Tomatoes",
            "97%"
         ],
         [
            "Metacritic",
            "90/100"
         ]
      ],
      "90",
      "8.9",
      "554,074",
      "tt0060196",
      "movie",
      "18 Nov 1997",
      "N/A",
      "United Artists",
      "N/A",
      "True"
   ],
   [
      "Fight Club",
      "1999",
      "R",
      "15 Oct 1999",
      "139 min",
      "Drama",
      "David Fincher",
      "Chuck Palahniuk (novel), Jim Uhls (screenplay)",
      "Edward Norton, Brad Pitt, Meat Loaf, Zach Grenier",
      "A nameless first person narrator (Edward Norton) attends support groups in attempt to subdue his emotional state and relieve his insomniac state. When he meets Marla (Helena Bonham Carter), another fake attendee of support groups, his life seems to become a little more bearable. However when he associates himself with Tyler (Brad Pitt) he is dragged into an underground fight club and soap making scheme. Together the two men spiral out of control and engage in competitive rivalry for love and power. When the narrator is exposed to the hidden agenda of Tyler's fight club, he must accept the awful truth that Tyler may not be who he says he is.",
      "English",
      "USA, Germany",
      "Nominated for 1 Oscar. Another 10 wins & 32 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BZGY5Y2RjMmItNDg5Yy00NjUwLThjMTEtNDc2OGUzNTBiYmM1XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.8/10"
         ],
         [
            "Rotten Tomatoes",
            "79%"
         ],
         [
            "Metacritic",
            "66/100"
         ]
      ],
      "66",
      "8.8",
      "1,499,074",
      "tt0137523",
      "movie",
      "06 Jun 2000",
      "N/A",
      "20th Century Fox",
      "http://www.foxmovies.com/fightclub/",
      "True"
   ],
   [
      "The Lord of the Rings: The Fellowship of the Ring",
      "2001",
      "PG-13",
      "19 Dec 2001",
      "178 min",
      "Adventure, Drama, Fantasy",
      "Peter Jackson",
      "J.R.R. Tolkien (novel), Fran Walsh (screenplay), Philippa Boyens (screenplay), Peter Jackson (screenplay)",
      "Alan Howard, Noel Appleby, Sean Astin, Sala Baker",
      "An ancient Ring thought lost for centuries has been found, and through a strange twist in fate has been given to a small Hobbit named Frodo. When Gandalf discovers the Ring is in fact the One Ring of the Dark Lord Sauron, Frodo must make an epic quest to the Cracks of Doom in order to destroy it! However he does not go alone. He is joined by Gandalf, Legolas the elf, Gimli the Dwarf, Aragorn, Boromir and his three Hobbit friends Merry, Pippin and Samwise. Through mountains, snow, darkness, forests, rivers and plains, facing evil and danger at every corner the Fellowship of the Ring must go. Their quest to destroy the One Ring is the only hope for the end of the Dark Lords reign!",
      "English, Sindarin",
      "New Zealand, USA",
      "Won 4 Oscars. Another 113 wins & 124 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BN2EyZjM3NzUtNWUzMi00MTgxLWI0NTctMzY4M2VlOTdjZWRiXkEyXkFqcGdeQXVyNDUzOTQ5MjY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.8/10"
         ],
         [
            "Rotten Tomatoes",
            "91%"
         ],
         [
            "Metacritic",
            "92/100"
         ]
      ],
      "92",
      "8.8",
      "1,357,873",
      "tt0120737",
      "movie",
      "06 Aug 2002",
      "$314,000,000",
      "New Line Cinema",
      "http://www.lordoftherings.net/film/trilogy/thefellowship.html",
      "True"
   ],
   [
      "Forrest Gump",
      "1994",
      "PG-13",
      "06 Jul 1994",
      "142 min",
      "Comedy, Drama, Romance",
      "Robert Zemeckis",
      "Winston Groom (novel), Eric Roth (screenplay)",
      "Tom Hanks, Rebecca Williams, Sally Field, Michael Conner Humphreys",
      "Forrest Gump is a simple man with a low I.Q. but good intentions. He is running through childhood with his best and only friend Jenny. His 'mama' teaches him the ways of life and leaves him to choose his destiny. Forrest joins the army for service in Vietnam, finding new friends called Dan and Bubba, he wins medals, creates a famous shrimp fishing fleet, inspires people to jog, starts a ping-pong craze, creates the smiley, writes bumper stickers and songs, donates to people and meets the president several times. However, this is all irrelevant to Forrest who can only think of his childhood sweetheart Jenny Curran, who has messed up her life. Although in the end all he wants to prove is that anyone can love anyone.",
      "English",
      "USA",
      "Won 6 Oscars. Another 39 wins & 66 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BNWIwODRlZTUtY2U3ZS00Yzg1LWJhNzYtMmZiYmEyNmU1NjMzXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.8/10"
         ],
         [
            "Rotten Tomatoes",
            "71%"
         ],
         [
            "Metacritic",
            "82/100"
         ]
      ],
      "82",
      "8.8",
      "1,406,942",
      "tt0109830",
      "movie",
      "28 Aug 2001",
      "$405,000",
      "Paramount Pictures",
      "http://www.paramount.com/movies/forrest-gump/",
      "True"
   ],
   [
      "Star Wars: Episode V - The Empire Strikes Back",
      "1980",
      "PG",
      "20 Jun 1980",
      "124 min",
      "Action, Adventure, Fantasy",
      "Irvin Kershner",
      "Leigh Brackett (screenplay by), Lawrence Kasdan (screenplay by), George Lucas (story by)",
      "Mark Hamill, Harrison Ford, Carrie Fisher, Billy Dee Williams",
      "Luke Skywalker, Han Solo, Princess Leia and Chewbacca face attack by the Imperial forces and its AT-AT walkers on the ice planet Hoth. While Han and Leia escape in the Millennium Falcon, Luke travels to Dagobah in search of Yoda. Only with the Jedi master's help will Luke survive when the dark side of the Force beckons him into the ultimate duel with Darth Vader.",
      "English",
      "USA",
      "Won 1 Oscar. Another 21 wins & 19 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BYmViY2M2MTYtY2MzOS00YjQ1LWIzYmEtOTBiNjhlMGM0NjZjXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.8/10"
         ],
         [
            "Rotten Tomatoes",
            "94%"
         ],
         [
            "Metacritic",
            "81/100"
         ]
      ],
      "81",
      "8.8",
      "932,564",
      "tt0080684",
      "movie",
      "21 Sep 2004",
      "$4,548,170",
      "Twentieth Century Fox",
      "http://www.starwars.com/episode-v/",
      "True"
   ],
   [
      "Inception",
      "2010",
      "PG-13",
      "16 Jul 2010",
      "148 min",
      "Action, Adventure, Sci-Fi",
      "Christopher Nolan",
      "Christopher Nolan",
      "Leonardo DiCaprio, Joseph Gordon-Levitt, Ellen Page, Tom Hardy",
      "Dom Cobb is a skilled thief, the absolute best in the dangerous art of extraction, stealing valuable secrets from deep within the subconscious during the dream state, when the mind is at its most vulnerable. Cobb's rare ability has made him a coveted player in this treacherous new world of corporate espionage, but it has also made him an international fugitive and cost him everything he has ever loved. Now Cobb is being offered a chance at redemption. One last job could give him his life back but only if he can accomplish the impossible - inception. Instead of the perfect heist, Cobb and his team of specialists have to pull off the reverse: their task is not to steal an idea but to plant one. If they succeed, it could be the perfect crime. But no amount of careful planning or expertise can prepare the team for the dangerous enemy that seems to predict their every move. An enemy that only Cobb could have seen coming.",
      "English, Japanese, French",
      "USA, UK",
      "Won 4 Oscars. Another 152 wins & 204 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMjAxMzY3NjcxNF5BMl5BanBnXkFtZTcwNTI5OTM0Mw@@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.8/10"
         ],
         [
            "Rotten Tomatoes",
            "86%"
         ],
         [
            "Metacritic",
            "74/100"
         ]
      ],
      "74",
      "8.8",
      "1,636,262",
      "tt1375666",
      "movie",
      "07 Dec 2010",
      "$292,568,851",
      "Warner Bros. Pictures",
      "http://inceptionmovie.warnerbros.com/",
      "True"
   ],
   [
      "The Lord of the Rings: The Two Towers",
      "2002",
      "PG-13",
      "18 Dec 2002",
      "179 min",
      "Adventure, Drama, Fantasy",
      "Peter Jackson",
      "J.R.R. Tolkien (novel), Fran Walsh (screenplay), Philippa Boyens (screenplay), Stephen Sinclair (screenplay), Peter Jackson (screenplay)",
      "Bruce Allpress, Sean Astin, John Bach, Sala Baker",
      "While Frodo and Sam, now accompanied by a new guide, continue their hopeless journey towards the land of shadow to destroy the One Ring, each member of the broken fellowship plays their part in the battle against the evil wizard Saruman and his armies of Isengard.",
      "English, Sindarin, Old English",
      "USA, New Zealand",
      "Won 2 Oscars. Another 117 wins & 138 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMDY0NmI4ZjctN2VhZS00YzExLTkyZGItMTJhOTU5NTg4MDU4XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.7/10"
         ],
         [
            "Rotten Tomatoes",
            "96%"
         ],
         [
            "Metacritic",
            "88/100"
         ]
      ],
      "88",
      "8.7",
      "1,208,118",
      "tt0167261",
      "movie",
      "26 Aug 2003",
      "$339,700,000",
      "New Line Cinema",
      "http://www.lordoftherings.net/",
      "True"
   ],
   [
      "One Flew Over the Cuckoo's Nest",
      "1975",
      "R",
      "19 Nov 1975",
      "133 min",
      "Drama",
      "Milos Forman",
      "Lawrence Hauben (screenplay), Bo Goldman (screenplay), Ken Kesey (based on the novel by), Dale Wasserman (the play version: \"One Flew Over the Cuckoo's Nest\" by)",
      "Michael Berryman, Peter Brocco, Dean R. Brooks, Alonzo Brown",
      "McMurphy has a criminal past and has once again gotten himself into trouble and is sentenced by the court. To escape labor duties in prison, McMurphy pleads insanity and is sent to a ward for the mentally unstable. Once here, McMurphy both endures and stands witness to the abuse and degradation of the oppressive Nurse Ratched, who gains superiority and power through the flaws of the other inmates. McMurphy and the other inmates band together to make a rebellious stance against the atrocious Nurse.",
      "English",
      "USA",
      "Won 5 Oscars. Another 30 wins & 13 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BZjA0OWVhOTAtYWQxNi00YzNhLWI4ZjYtNjFjZTEyYjJlNDVlL2ltYWdlL2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.7/10"
         ],
         [
            "Rotten Tomatoes",
            "95%"
         ],
         [
            "Metacritic",
            "80/100"
         ]
      ],
      "80",
      "8.7",
      "747,367",
      "tt0073486",
      "movie",
      "09 Dec 1997",
      "N/A",
      "United Artists",
      "N/A",
      "True"
   ],
   [
      "Goodfellas",
      "1990",
      "R",
      "21 Sep 1990",
      "146 min",
      "Crime, Drama",
      "Martin Scorsese",
      "Nicholas Pileggi (book), Nicholas Pileggi (screenplay), Martin Scorsese (screenplay)",
      "Robert De Niro, Ray Liotta, Joe Pesci, Lorraine Bracco",
      "Henry Hill might be a small time gangster, who may have taken part in a robbery with Jimmy Conway and Tommy De Vito, two other gangsters who might have set their sights a bit higher. His two partners could kill off everyone else involved in the robbery, and slowly start to think about climbing up through the hierarchy of the Mob. Henry, however, might be badly affected by his partners' success, but will he consider stooping low enough to bring about the downfall of Jimmy and Tommy?",
      "English, Italian",
      "USA",
      "Won 1 Oscar. Another 37 wins & 34 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BNThjMzczMjctZmIwOC00NTQ4LWJhZWItZDdhNTk5ZTdiMWFlXkEyXkFqcGdeQXVyNDYyMDk5MTU@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.7/10"
         ],
         [
            "Rotten Tomatoes",
            "97%"
         ],
         [
            "Metacritic",
            "89/100"
         ]
      ],
      "89",
      "8.7",
      "803,460",
      "tt0099685",
      "movie",
      "26 Mar 1997",
      "N/A",
      "Warner Bros.",
      "N/A",
      "True"
   ],
   [
      "The Matrix",
      "1999",
      "R",
      "31 Mar 1999",
      "136 min",
      "Action, Sci-Fi",
      "Lana Wachowski, Lilly Wachowski",
      "Lilly Wachowski, Lana Wachowski",
      "Keanu Reeves, Laurence Fishburne, Carrie-Anne Moss, Hugo Weaving",
      "Thomas A. Anderson is a man living two lives. By day he is an average computer programmer and by night a hacker known as Neo. Neo has always questioned his reality, but the truth is far beyond his imagination. Neo finds himself targeted by the police when he is contacted by Morpheus, a legendary computer hacker branded a terrorist by the government. Morpheus awakens Neo to the real world, a ravaged wasteland where most of humanity have been captured by a race of machines that live off of the humans' body heat and electrochemical energy and who imprison their minds within an artificial reality known as the Matrix. As a rebel against the machines, Neo must return to the Matrix and confront the agents: super-powerful computer programs devoted to snuffing out Neo and the entire human rebellion.",
      "English",
      "USA",
      "Won 4 Oscars. Another 34 wins & 45 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BNzQzOTk3OTAtNDQ0Zi00ZTVkLWI0MTEtMDllZjNkYzNjNTc4L2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.7/10"
         ],
         [
            "Rotten Tomatoes",
            "87%"
         ],
         [
            "Metacritic",
            "73/100"
         ]
      ],
      "73",
      "8.7",
      "1,346,758",
      "tt0133093",
      "movie",
      "21 Sep 1999",
      "N/A",
      "Warner Bros. Pictures",
      "http://www.whatisthematrix.com",
      "True"
   ],
   [
      "Seven Samurai",
      "1954",
      "NOT RATED",
      "19 Nov 1956",
      "207 min",
      "Adventure, Drama",
      "Akira Kurosawa",
      "Akira Kurosawa (screenplay), Shinobu Hashimoto (screenplay), Hideo Oguni (screenplay)",
      "Toshiro Mifune, Takashi Shimura, Keiko Tsushima, Yukiko Shimazaki",
      "A veteran samurai, who has fallen on hard times, answers a village's request for protection from bandits. He gathers 6 other samurai to help him, and they teach the townspeople how to defend themselves, and they supply the samurai with three small meals a day. The film culminates in a giant battle when 40 bandits attack the village.",
      "Japanese",
      "Japan",
      "Nominated for 2 Oscars. Another 5 wins & 6 nominations.",
      "https://images-na.ssl-images-amazon.com/images/M/MV5BMTc5MDY1MjU5MF5BMl5BanBnXkFtZTgwNDM2OTE4MzE@._V1_SX300.jpg",
      [
         [
            "Internet Movie Database",
            "8.7/10"
         ],
         [
            "Rotten Tomatoes",
            "100%"
         ],
         [
            "Metacritic",
            "98/100"
         ]
      ],
      "98",
      "8.7",
      "251,469",
      "tt0047478",
      "movie",
      "01 Mar 1999",
      "N/A",
      "Columbia Pictures",
      "N/A",
      "True"
   ]
]


